<p><a name="sections"></a></p>
<br>
<br>
# Sections

- <a href="#DS">Data Stucture</a><br>
    - <a href="#series">Series</a><br>
    - <a href="#labseries">In class lab: Series</a><br>
    - <a href="#DF">DataFrame</a><br>
    - <a href="#labDF">In class lab: DataFrame</a><br>
    - <a href="#IO">I/O tools</a><br>
    - <a href="#labIO">In class lab: I/O tools</a><br>
- <a href="#DMpandas">Data Manipulation with Pandas</a><br>
    - <a href="#concat">concat</a><br>
    - <a href="#labconcat">In class lab: concat</a><br>
    - <a href="#merge">merge</a><br>
    - <a href="#labmerge">In class lab: merge</a><br>
- <a href="#moreDM">More on Data Manipulation</a><br>
    - <a href="#arith">arithmetic</a><br>
    - <a href="#drop">drop</a><br>
    - <a href="#apply">apply</a><br>
    - <a href="#describe">describe</a><br>
    - <a href="#SF">selection and filter</a><br>
    - <a href="#labmoreDM">In class lab: More on Data Manipulation</a><br>
- <a href="#miss">Handling Missing Data</a><br>
    - <a href="#labmiss">In class lab: Handling Missing Data</a><br>

<p><a name="DS"></a></p>
# Data Structure

- Pandas is a large package defining several new data types, plus a variety of convenient functions for data manipulation, plotting, and web scraping.

- The *DataFrame* structure is inspired by the type of same name in R, a programming language popular among statisticians and data scientists.

- Pandas is particularly strong in the area of handling missing data and, relatedly, handling time series data.

- There are four new data structures in pandas: Series, DataFrame, time series and panel. We will mainly discuss the first three.

These are the new data types introduced by pandas:

- **Series**: 1D labeled homogeneously-typed array.
- **Time Series**: Series with index containing datetimes.
- **DataFrame**: General 2D labeled, size-mutable tabular structure with potentially heterogeneously-typed columns.
- **Panel**: General 3D labeled, also size-mutable array.

We first import the package

In [1]:
import numpy as np
import pandas as pd

<p><a name="series"></a></p>
## Series

A series is a one-dimensional array-like object containing an array of data (of any NumPy data type) and an associated array of data labels, called its index. By default, the index just consists of ordinary array indices, i.e. consecutive integers starting from zero.

In [2]:
obj = pd.Series(['a', 'b', 'c', 'd'])
obj

0    a
1    b
2    c
3    d
dtype: object

Often it will be more desirable to create a series with an index identifying each data point. Here we manually set the index from 1 to 4.

In [3]:
obj2 = pd.Series(['a', 'b', 'c', 'd'], index=[1, 2, 3, 4])
obj2

1    a
2    b
3    c
4    d
dtype: object

We can also modify the index directly.

In [4]:
obj.index = ['A', 'B', 'C', 'D']
obj       # Check the result

A    a
B    b
C    c
D    d
dtype: object

We can access values in a series by index.

In [5]:
obj['B']

'b'

Slicing can be done in a similar way.

In [6]:
obj[['A', 'B']]

A    a
B    b
dtype: object

The method `values` accesses all the values.

In [7]:
obj.values

array(['a', 'b', 'c', 'd'], dtype=object)

In [8]:
obj.values[1]   # obj.values is simply an array

'b'

The **Series** object is similar to a **dictionary**, `Series.index` is like `dictionary.keys`, and `Series.values` is like `dictionary.values`. We can convert a dictionary to a Series directly:

In [9]:
dict_ = {1: 'a', 2: 'b', 3: 'c', 4: 'd'}
obj3 = pd.Series(dict_)
obj3

1    a
2    b
3    c
4    d
dtype: object

We can of course convert a Series back to a dictionary.

In [10]:
obj3.to_dict()

{1: 'a', 2: 'b', 3: 'c', 4: 'd'}

<p><a name="labseries"></a></p>
## In class lab: Series

 **Exercise 1.** Create a pandas Series whose entries are `['analyst', 'associate', 'VP', 'analyst']`. Call the series "`title`".

In [11]:
#### Your code here

0      analyst
1    associate
2           VP
3      analyst
dtype: object

** Exercise 2.** Index this series by `['Bob', 'Sam', 'Peter', 'Jake']`

In [12]:
#### Your code here

Bob        analyst
Sam      associate
Peter           VP
Jake       analyst
dtype: object

 **Exercise 3.** Create the same series with dictionary notation. Call it `title_2`.

In [13]:
#### Your code here

Bob        analyst
Jake       analyst
Peter           VP
Sam      associate
dtype: object

**Exercise 4.** Check if *title* equal to *title_2*(`title == title_2`). What does it return? If it indicates `title` and `title_2` are not the same, why?

In [14]:
#### Your code here

False

- In this exercise, we see that for the dictionary type, only the key-value pair matters; however, for the Series type, the order of the indices also makes differences.

**Exercise 5.** How do we fix the problem in Exercise 4? Try to use the **`sort_values`** method. If you don't know what it is, google 'sort pandas series'.

In [15]:
# Series.sort_values(axis=0, ascending=True, kind='quicksort', na_position='last', inplace=True)
#### Your code here

- We print out the result of `sort_values` method.

In [16]:
print tmp_1
print '-'*55
print tmp_2

Peter           VP
Bob        analyst
Jake       analyst
Sam      associate
dtype: object
-------------------------------------------------------
Peter           VP
Bob        analyst
Jake       analyst
Sam      associate
dtype: object

In [17]:
(tmp_1==tmp_2).all()

True

Here we demonstrate more on `sort_values`.

- We may pass `ascending=False` to the `sort_values` method. The result is obviously:

In [18]:
title.sort_values(inplace=False, ascending=False)

Sam      associate
Jake       analyst
Bob        analyst
Peter           VP
dtype: object

- But what happen if we pass `inplace=True`? Notice that at this point, `series` is not sorted yet:

In [19]:
print title

Bob        analyst
Sam      associate
Peter           VP
Jake       analyst
dtype: object

- However, if we use `inplace=True`.

In [20]:
tmp_1=title.sort_values(inplace=True, ascending=True)           
tmp_2=title_2.sort_values(inplace=True, ascending=True)

print tmp_1
print '-'*55
print tmp_2
print '-'*55
print (tmp_1 == tmp_2).all()

None
-------------------------------------------------------
None
-------------------------------------------------------

AttributeError: 'bool' object has no attribute 'all'

- Once we use `inplace=True`, the mehod `sort_values` mutate the value in memory directly. Therefore, `sort_values` becomes a mutating operator, without returning any value. Therefore,
 - Both `tmp_1` and `tmp_2` are `None`.
 - `(tmp_1 == tmp_2)` is `True`, which is a bool object and have no method `all`. **Read the error message above.**
 - But the series is now sorted:

In [21]:
print title

Peter           VP
Bob        analyst
Jake       analyst
Sam      associate
dtype: object

** The in class lab ends!**
<p><a name="DF"></a></p>
## DataFrame

A data frame represents a tabular, spreadsheet-like data structure containing an ordered collection of columns, each of which can be a different value type (integers, strings, floating point numbers, Python objects, etc.), but all must be the same length.

In [22]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
# convert to DataFrame
df = pd.DataFrame(data)
df

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

A data frame can be created with nested list as well. The two ways are equivalent.

In [23]:
df_2=pd.DataFrame([[1.5, 'Ohio', 2000],
                   [1.7, 'Ohio', 2001],
                   [3.6, 'Ohio', 2002],
                   [2.4, 'Nevada', 2001],
                   [2.9, 'Nevada', 2002]], 
                    columns=['pop','state','year'])
df_2

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [24]:
print df == df_2

    pop state  year
0  True  True  True
1  True  True  True
2  True  True  True
3  True  True  True
4  True  True  True

In [25]:
print (df == df_2).all()

pop      True
state    True
year     True
dtype: bool

In [26]:
print ((df == df_2).all()).all()

True

A data frame has an attribute **values**, which is of the multidimensional array type.

In [27]:
print df.values
print '-'*55
print df_2.values

[[1.5 'Ohio' 2000]
 [1.7 'Ohio' 2001]
 [3.6 'Ohio' 2002]
 [2.4 'Nevada' 2001]
 [2.9 'Nevada' 2002]]
-------------------------------------------------------
[[1.5 'Ohio' 2000]
 [1.7 'Ohio' 2001]
 [3.6 'Ohio' 2002]
 [2.4 'Nevada' 2001]
 [2.9 'Nevada' 2002]]

data frame v.s. series is similar to 2D array v.s. 1D array. A data frame has column names.

In [28]:
df.columns    # column name
# here u'pop' means the string 'pop' is encoded in unicode

Index([u'pop', u'state', u'year'], dtype='object')

Each column in a DataFrame can be retrieved as a Series. We have two ways to get the column: to retrieve by attribute and to retrieve by dictionary-like notation. They will give the same result.

In [29]:
df.year         # retrieve by attribute

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

In [30]:
df['year']  # retrieve by dictionary-like notation

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

<p><a name="labDF"></a></p>
## In class lab: DataFrame

** Exercise 6.** Create a Pandas DataFrame, 'Employee', whose columns are 'Name', 'Year' and 'Department'. The rows are supposed to be:

- Bob has been working for IT department for a year.
- Sam has been working for Trade department for 3 years.
- Peter has been working for HR department for 8 years.
- Jake has been working for IT department for 2 years.

In [31]:
#### Your code here

  Department   Name  Year
0         IT    Bob     1
1      Trade    Sam     3
2         HR  Peter     8
3         IT   Jake     2

**Exercise 7.** Now set the index of Employee to be their names. Make sure you update the data frame.
- **Remark** recording information in the index can cause problems when applying the merge function, as we will see later.

In [32]:
#### Your code here

      Department  Year
Name
Bob           IT     1
Sam        Trade     3
Peter         HR     8
Jake          IT     2

- Again, we see that `set_index` is not a mutating operator by printing out `Employee` to see that the data frame remains unchanged.

In [33]:
Employee

  Department   Name  Year
0         IT    Bob     1
1      Trade    Sam     3
2         HR  Peter     8
3         IT   Jake     2

In [34]:
Employee = Employee.set_index('Name') 
Employee

      Department  Year
Name
Bob           IT     1
Sam        Trade     3
Peter         HR     8
Jake          IT     2

**Remark** In the past, people complaint about the extra row with **Name** up there. It is really just to you see the name of the index (Note that the index is created with a column, which has a name). If you print out the index:

In [35]:
Employee.index

Index([u'Bob', u'Sam', u'Peter', u'Jake'], dtype='object', name=u'Name')

To remove that extra attibute **name**, we can use the **`rename`** method:

In [36]:
Employee.index.rename(None, inplace=True)
Employee

      Department  Year
Bob           IT     1
Sam        Trade     3
Peter         HR     8
Jake          IT     2

**Exercise 8.** What is the type of `Employee['Department']`?

In [37]:
#### Your code here

pandas.core.series.Series

**Remark**

This illustrate the fact that once we select a column, we got a `Series`. However, if we want to keep the `DataFrame` structure but with only one column, we can do:

In [38]:
Employee[['Department']]

      Department
Bob           IT
Sam        Trade
Peter         HR
Jake          IT

In [39]:
type(Employee[['Department']])

pandas.core.frame.DataFrame

**The in class lab ends**

<p><a name="IO"></a></p>
## I/O tools

Pandas has a number of functions for reading tabular data as a data frame object.

In [40]:
!cat foo.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [41]:
pd.read_csv('foo.csv')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [42]:
!cat foo.txt

a	b	c	d	message
1	2	3	4	hello
5	6	7	8	world
9	10	11	12	foo

In [43]:
pd.read_table('foo.txt')  # use tab as the default delimiter

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

- Note that both functions consider the first row as a header giving the column names, and both add incremental numbers as index.

Parsing can't be done properly with a bad delimiter

In [44]:
# read_csv reads a \t separated file
pd.read_csv('foo.txt')

  a\tb\tc\td\tmessage
0   1\t2\t3\t4\thello
1   5\t6\t7\t8\tworld
2  9\t10\t11\t12\tfoo

- We saw the data frame becomes messy with a bad delimiter.

The problem will be fixed by passing sep = '\t' to read_csv.

In [45]:
# read_csv reads a \t separated file
pd.read_csv('foo.txt', sep='\t')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In some cases, there is no header in the file. Set `header = None`, the column names will be filled with incremental numbers.

In [46]:
!cat foo_noheader.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [47]:
pd.read_csv('foo_noheader.csv', header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

But we can pass the column names (as a list of strings) to the names parameter in `read_csv`.

In [48]:
# Set the names manually
pd.read_csv('foo_noheader.csv', 
             names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

<p><a name="labIO"></a></p>
## In class lab: I/O tools
So far we covered only importing a file. With this exercise we first demonstrate how exporting is done.


**Exercise 9.** Write the data frame, `Employee`, to a file, Employee.csv. The function `to_csv` should comes in handy.

In [49]:
#### Your code here

- Inspect the csv file we created.

In [50]:
!cat Employee.csv

,Department,Year
Bob,IT,1
Sam,Trade,3
Peter,HR,8
Jake,IT,2

**Exercise 10.** Read the csv file back into a data frame and call it `Employee2`. Is it the same as `Employee`?

In [51]:
#### Your code here

** Exercise 11.** Test if `Employee == Employee2`. If not, fix it.

In [52]:
#### Your code here

ValueError: Can only compare identically-labeled DataFrame objects

In [53]:
Employee2 = pd.read_csv('Employee.csv', index_col=0)
Employee2 == Employee

      Department  Year
Bob         True  True
Sam         True  True
Peter       True  True
Jake        True  True

In [54]:
(Employee == Employee2).all()

Department    True
Year          True
dtype: bool

In [55]:
((Employee == Employee2).all()).all()

True

** Exercise 12.** Read the file `Employee.txt` into a data frame.

In [56]:
!cat Employee.txt

Name	Department	Year
Bob	IT	1
Sam	Trade	3
Peter	HR	8
Jake	IT	2

In [57]:
#### Your code here

      Department  Year
Name
Bob           IT     1
Sam        Trade     3
Peter         HR     8
Jake          IT     2

**The in class lab ends.**

<p><a name="DMpandas"></a></p>
# Data Manipulation in Pandas

Like numpy, pandas defines many broadcast operations, as well as numerous methods of manipulating data.
<p><a name="concat"></a></p>
## `concat`
Pandas DataFrames can be expanded in both directions. Lets create two data frames first.

In [58]:
df1 = pd.DataFrame(np.arange(9).reshape((3, 3)), 
                   columns=['a', 'b', 'c'],
                   index=['one', 'two', 'three'])
df2 = pd.DataFrame(np.arange(6).reshape((3, 2)), 
                   columns=['d','e'],
                   index=['one', 'two', 'three'])
df1

       a  b  c
one    0  1  2
two    3  4  5
three  6  7  8

In [59]:
df2

       d  e
one    0  1
two    2  3
three  4  5

Since the two data frames have the same number of rows, it is natural that we can combine them "horizontally".

In [60]:
pd.concat([df1, df2], axis = 1)

       a  b  c  d  e
one    0  1  2  0  1
two    3  4  5  2  3
three  6  7  8  4  5

- The argument "axis = 1" indicates expanding along the column indices.

We some time want to extend the Pandas DataFrames in a "vertical" direction. Lets create two data frames first.

In [61]:
df1 = pd.DataFrame(np.arange(4).reshape((2, 2)), 
                   columns=['a', 'b'],
                   index=['one', 'two'])
df2 = pd.DataFrame(np.arange(6).reshape((3, 2)), 
                   columns=['a','b'],
                   index=['four', 'five', 'six'])
df1

     a  b
one  0  1
two  2  3

In [62]:
df2

      a  b
four  0  1
five  2  3
six   4  5

Again we use `concat`. But this time we pass `axis=0` to indicate expand along row indices:

In [63]:
pd.concat([df1, df2], axis = 0)

      a  b
one   0  1
two   2  3
four  0  1
five  2  3
six   4  5

The argument 'axis' actually default default to 0, so the code below is equivalent.

In [64]:
pd.concat([df1, df2])

      a  b
one   0  1
two   2  3
four  0  1
five  2  3
six   4  5

<p><a name="labconcat"></a></p>
## In class lab: concat

**Exercise 13.** Before we concatenate multiple data frames, let's consider an easier case. Recall that we created a Series recording the title of everybody. Combine it with our `Employee` data frame.

In [65]:
Employee

      Department  Year
Bob           IT     1
Sam        Trade     3
Peter         HR     8
Jake          IT     2

In [66]:
#### Your code here

      Department  Year      Title
Bob           IT     1    analyst
Sam        Trade     3  associate
Peter         HR     8         VP
Jake          IT     2    analyst

**Exercise 14.** Consider if we have a data frame with new features recorded (as in the following data frame), how should we combine it with the old data frame?

In [67]:
new_features = pd.DataFrame({'Education':['Bachelor','PHD','Master','Master'],\
                           'Sex':['M','M','M','M']},\
                            index=['Bob', 'Sam', 'Peter', 'Jake'])
new_features

      Education Sex
Bob    Bachelor   M
Sam         PHD   M
Peter    Master   M
Jake     Master   M

In [68]:
#### Your code here

      Department  Year      Title Education Sex
Bob           IT     1    analyst  Bachelor   M
Sam        Trade     3  associate       PHD   M
Peter         HR     8         VP    Master   M
Jake          IT     2    analyst    Master   M

**Exercise 15.** Consider if we have a data frame with new observations recorded (as in the following data frame), how should we combine it with the old data frame?

In [69]:
new_observations = pd.DataFrame({'Department':['IT','?','Trade','HR','HR'],\
                             'Title':['VP','associate','associate','analyst','analyst'],\
                             'Sex':['F', 'F','F','M','F'], 'Year':[9,5,np.NaN,2,2],\
                             'Education':['','PHD','Master','Master','Bachelor']},\
                             index=['Mary','Amy','Jennifer','John','Judy'])
new_observations

         Department Education Sex      Title  Year
Mary             IT             F         VP   9.0
Amy               ?       PHD   F  associate   5.0
Jennifer      Trade    Master   F  associate   NaN
John             HR    Master   M    analyst   2.0
Judy             HR  Bachelor   F    analyst   2.0

In [70]:
#### Your code here

         Department Education Sex      Title  Year
Bob              IT  Bachelor   M    analyst   1.0
Sam           Trade       PHD   M  associate   3.0
Peter            HR    Master   M         VP   8.0
Jake             IT    Master   M    analyst   2.0
Mary             IT             F         VP   9.0
Amy               ?       PHD   F  associate   5.0
Jennifer      Trade    Master   F  associate   NaN
John             HR    Master   M    analyst   2.0
Judy             HR  Bachelor   F    analyst   2.0

**The in class lab ends.**
<p><a name="merge"></a></p>
## `merge`
Merging is the most common way to combine multiple data frames. Lets create two data frames first.

In [71]:
df1 = pd.DataFrame(np.array([0,0,0,2,2,2,8,8,8]).\
                   reshape((3, 3)),columns=['a','b','c'],
                   index=['one', 'two', 'three'])
df2 = pd.DataFrame(np.arange(6).reshape((3, 2)), 
                   columns=['b', 'd'],
                   index=['one', 'two', 'four'])
df1

       a  b  c
one    0  0  0
two    2  2  2
three  8  8  8

In [72]:
df2

      b  d
one   0  1
two   2  3
four  4  5

The code below identifies the column b from both data frames. The argument 'inner' means it only keeps rows occur in both data frames.

In [73]:
pd.merge(df1, df2, how='inner', on ='b')

   a  b  c  d
0  0  0  0  1
1  2  2  2  3

Without specifying 'how', its default to be 'inner'. So the following code performs the same task as above.

In [74]:
pd.merge(df1, df2, on ='b')

   a  b  c  d
0  0  0  0  1
1  2  2  2  3

If we want to keep every row in df1, then we can specify how = "left".

In [75]:
pd.merge(df1, df2, how='left', on ='b')

   a  b  c    d
0  0  0  0  1.0
1  2  2  2  3.0
2  8  8  8  NaN

- Since `df2` does not have a row with `b=8`, pandas leaves NaN for column d.

If we want to keep every row in df2, then we can specify how = "right".

In [76]:
pd.merge(df1, df2, how='right', on ='b')

     a    b    c  d
0  0.0  0.0  0.0  1
1  2.0  2.0  2.0  3
2  NaN  4.0  NaN  5

- Since df1 does not have the row with `b=4`, pandas leaves NaN for columns a and c.

If we want to keep all rows from both df1 and df2, then we can specify how = "outer".

In [77]:
pd.merge(df1, df2, how='outer', on ='b')

     a    b    c    d
0  0.0  0.0  0.0  1.0
1  2.0  2.0  2.0  3.0
2  8.0  8.0  8.0  NaN
3  NaN  4.0  NaN  5.0

We can also merge on columns with different columns.

In [78]:
pd.merge(df1, df2, right_on='b', left_on='a')

   a  b_x  c  b_y  d
0  0    0  0    0  1
1  2    2  2    2  3

- Since we have a row with a=0 in df1 and a row with b=0 in df2, they are identified. Similarly the row with a=2 in df1 and the row with b=2 in df2 are identified. Since the inner merge is default, and there is no row with a=b=4 nor a=b=8, so those two rows are discarded. Since this time the column b from the two data frames are not identified, there are still two after merging, namely, `b_x` and `b_y`.
<p><a name="labmerge"></a></p>
## In class lab: merge

**Exercise 16.** Run the following code to create a data frame, 'Salary'. How is this related to the Employee data frame? Why do we separate this piece of information into another data frame?

In [79]:
Salary = pd.DataFrame({'Title':['VP', 'associate', 'analyst'],\
                      'Salary':[250, 120, 90]},\
                      columns=['Title', 'Salary'])
Salary

       Title  Salary
0         VP     250
1  associate     120
2    analyst      90

In [80]:
Employee

         Department Education Sex      Title  Year
Bob              IT  Bachelor   M    analyst   1.0
Sam           Trade       PHD   M  associate   3.0
Peter            HR    Master   M         VP   8.0
Jake             IT    Master   M    analyst   2.0
Mary             IT             F         VP   9.0
Amy               ?       PHD   F  associate   5.0
Jennifer      Trade    Master   F  associate   NaN
John             HR    Master   M    analyst   2.0
Judy             HR  Bachelor   F    analyst   2.0

In [81]:
#### Your answer here

**Exercise 17.** How should we combine the two data frames in a meaningful way?
- **Caution** We mentioned that having the information 'Name' in the index might cause problem when merging. Pay attention to the indices after merging. **Don't update your `Employee` if you are not sure yet what will happen to the indices after applying `merge`.**

In [82]:
#### Your code here

  Department Education Sex      Title  Year  Salary
0         IT  Bachelor   M    analyst   1.0      90
1         IT    Master   M    analyst   2.0      90
2         HR    Master   M    analyst   2.0      90
3         HR  Bachelor   F    analyst   2.0      90
4      Trade       PHD   M  associate   3.0     120
5          ?       PHD   F  associate   5.0     120
6      Trade    Master   F  associate   NaN     120
7         HR    Master   M         VP   8.0     250
8         IT             F         VP   9.0     250

- In general, indices from the original data frames are meaningless after merging. Consider in this particular case, obviously the indices of `Salary` becomes useless because rows in `Salary` are duplicated. In general, this can happen to both data frames. Below is an example:

In [83]:
A=pd.DataFrame([[1,2],[1,3],[2,4]], columns=['key', 'value'])
B=pd.DataFrame([[2,5],[2,6],[1,7]], columns=['key', 'value'])
A

   key  value
0    1      2
1    1      3
2    2      4

In [84]:
B

   key  value
0    2      5
1    2      6
2    1      7

In [85]:
pd.merge(A,B, on='key')

   key  value_x  value_y
0    1        2        7
1    1        3        7
2    2        4        5
3    2        4        6

- Thus, there is no natural way for `merge` to keep the indices.

Since the Name information is important, we can keep it by make a copy of it in a column.

In [86]:
Employee['Name']=Employee.index
Employee

         Department Education Sex      Title  Year      Name
Bob              IT  Bachelor   M    analyst   1.0       Bob
Sam           Trade       PHD   M  associate   3.0       Sam
Peter            HR    Master   M         VP   8.0     Peter
Jake             IT    Master   M    analyst   2.0      Jake
Mary             IT             F         VP   9.0      Mary
Amy               ?       PHD   F  associate   5.0       Amy
Jennifer      Trade    Master   F  associate   NaN  Jennifer
John             HR    Master   M    analyst   2.0      John
Judy             HR  Bachelor   F    analyst   2.0      Judy

- Then we merge `Employee` and `Salary`.

In [87]:
Employee = pd.merge(Employee, Salary, on='Title')
Employee

  Department Education Sex      Title  Year      Name  Salary
0         IT  Bachelor   M    analyst   1.0       Bob      90
1         IT    Master   M    analyst   2.0      Jake      90
2         HR    Master   M    analyst   2.0      John      90
3         HR  Bachelor   F    analyst   2.0      Judy      90
4      Trade       PHD   M  associate   3.0       Sam     120
5          ?       PHD   F  associate   5.0       Amy     120
6      Trade    Master   F  associate   NaN  Jennifer     120
7         HR    Master   M         VP   8.0     Peter     250
8         IT             F         VP   9.0      Mary     250

- As you might have noticed already, there are "invalid" data included. We will see how we can deal with it later.

**The in class lab ends**

<p><a name="moreDM"></a></p>
# More on Data Manipulation

One of the most important pandas features is the behavior of arithmetic between objects with different indices. Lets create two data frames first.
<p><a name="arith"></a></p>
## Arithmetic

In [88]:
df1 = pd.DataFrame(np.arange(9).reshape((3, 3)), 
                   columns=['a', 'b', 'c'],
                   index=['one', 'two', 'three'])
df2 = pd.DataFrame(np.arange(12).reshape((4, 3)), 
                   columns=['b', 'c', 'd'],
                   index=['zero', 'one', 'two', 'three'])

We can easily add them by using the + sign.

In [89]:
df1

       a  b  c
one    0  1  2
two    3  4  5
three  6  7  8

In [90]:
df2

       b   c   d
zero   0   1   2
one    3   4   5
two    6   7   8
three  9  10  11

In [91]:
# Addition returns a DataFrame whose index and columns are
# the unions of the ones in each DataFrame
df3 = df1 + df2 
df3

        a     b     c   d
one   NaN   4.0   6.0 NaN
three NaN  16.0  18.0 NaN
two   NaN  10.0  12.0 NaN
zero  NaN   NaN   NaN NaN

<p><a name="drop"></a></p>
## drop

The drop method can be used to drop some columns and rows.

In [92]:
# drop column 'd'
# axis = 1 means drop column
df2 = df2.drop('d', axis=1) 
df2

       b   c
zero   0   1
one    3   4
two    6   7
three  9  10

In [93]:
# drop row 'zero'
# axis = o means drop row
df2 = df2.drop('zero', axis=0) 
df2

       b   c
one    3   4
two    6   7
three  9  10

<p><a name="apply"></a></p>
## `apply`

DataFrames `apply` method applies a function on 1D arrays to each column or row.

In [94]:
# minimum number in each column
df1.apply(min, axis=0)

a    0
b    1
c    2
dtype: int64

In [95]:
# minimum number in each row
df1.apply(min, axis=1)

one      0
two      3
three    6
dtype: int64

<p><a name="describe"></a></p>
## `describe`

The `describe` method computes a set of summary statistics for a Series or for each data frame's column.

In [96]:
df1.describe()

         a    b    c
count  3.0  3.0  3.0
mean   3.0  4.0  5.0
std    3.0  3.0  3.0
min    0.0  1.0  2.0
25%    1.5  2.5  3.5
50%    3.0  4.0  5.0
75%    4.5  5.5  6.5
max    6.0  7.0  8.0

<p><a name="SF"></a></p>
## selection and filter

The `loc` method provides purely label (index/columns)-based indexing. This method only allows you do selection from a data frame by its index and columns. For example:

In [97]:
df1['a']

one      0
two      3
three    6
Name: a, dtype: int64

In [98]:
df1.loc['two'] # the row that has index two

a    3
b    4
c    5
Name: two, dtype: int64

You can also pass a second parameter to loc to specify which column you want to choose. For example:

In [99]:
df1.loc['two', 'b'] # the row that has index two and column b

4

Fancy indexing as in Numpy can be done with `loc` in pandas as well. We may select a row with a condition:

In [100]:
df1.loc[df1.a==0,:]

     a  b  c
one  0  1  2

We may select columns in a similar way:

In [101]:
df1.loc[:,df1.loc['one']==0]

       a
one    0
two    3
three  6

Note: loc only accepts labels as input. If you try to use numbers, it will give you an error. For example:

In [102]:
df1.loc[1, 2]

TypeError: cannot do label indexing on <class 'pandas.indexes.base.Index'> with these indexers [1] of <type 'int'>

If you want to select data by number, you need the help of `iloc`. The `iloc` method provides a purely position based indexing.

In [103]:
# select as a matrix 
# row 2, col 3
df1.iloc[1, 2]

5

In [104]:
# first row, first two columns
# return a Series
row1 = df1.iloc[0, :2]
row1

a    0
b    1
Name: one, dtype: int64

<p><a name="labmoreDM"></a></p>
## In class lab: More on Data Manipulation

**Exercise 18.** From the `df1` we created, what should we do if we want to select the elements greater than 4?
- **Remark** It's unlikely that we can keep the `data frame` structure after selecting?

In [105]:
#### Your code here

array([5, 6, 7, 8])

**Demonstration: `.head()` and `.tail()`**

We demonstrate some other convenient methods to glance the data: `head` and `tail`. The former shows the first 5 rows in the data frame, the latter show the last 5.

In [106]:
Employee.head()

  Department Education Sex      Title  Year  Name  Salary
0         IT  Bachelor   M    analyst   1.0   Bob      90
1         IT    Master   M    analyst   2.0  Jake      90
2         HR    Master   M    analyst   2.0  John      90
3         HR  Bachelor   F    analyst   2.0  Judy      90
4      Trade       PHD   M  associate   3.0   Sam     120

In [107]:
Employee.tail()

  Department Education Sex      Title  Year      Name  Salary
4      Trade       PHD   M  associate   3.0       Sam     120
5          ?       PHD   F  associate   5.0       Amy     120
6      Trade    Master   F  associate   NaN  Jennifer     120
7         HR    Master   M         VP   8.0     Peter     250
8         IT             F         VP   9.0      Mary     250

We can specify the number of rows shown:

In [108]:
Employee.head(3)

  Department Education Sex    Title  Year  Name  Salary
0         IT  Bachelor   M  analyst   1.0   Bob      90
1         IT    Master   M  analyst   2.0  Jake      90
2         HR    Master   M  analyst   2.0  John      90

** Exercise 19.** Give VPs a 5% raise!

In [109]:
#### Your code here

  Department Education Sex      Title  Year      Name  Salary
0         IT  Bachelor   M    analyst   1.0       Bob    90.0
1         IT    Master   M    analyst   2.0      Jake    90.0
2         HR    Master   M    analyst   2.0      John    90.0
3         HR  Bachelor   F    analyst   2.0      Judy    90.0
4      Trade       PHD   M  associate   3.0       Sam   120.0
5          ?       PHD   F  associate   5.0       Amy   120.0
6      Trade    Master   F  associate   NaN  Jennifer   120.0
7         HR    Master   M         VP   8.0     Peter   262.5
8         IT             F         VP   9.0      Mary   262.5

**Exercise 20.** Apply the method `describe` on `Employee`. How many columns are there? Why?

In [111]:
#### Your code here

           Year      Salary
count  8.000000    9.000000
mean   4.000000  138.333333
std    3.023716   71.752613
min    1.000000   90.000000
25%         NaN   90.000000
50%         NaN  120.000000
75%         NaN  120.000000
max    9.000000  262.500000

**Exercise 21.** Find the sum of the two columns, Salary and Year.

In [112]:
#### Your code here

Salary    1245.0
Year         NaN
dtype: float64

**Exercise 22.** For each row, sum up the Salary and Year.

In [114]:
#### Your code here

0     91.0
1     92.0
2     92.0
3     92.0
4    123.0
5    125.0
6    120.0
7    270.5
8    271.5
dtype: float64

<p><a name="miss"></a></p>
# Handling Missing Data

Missing - or, what amounts to the same thing, corrupt - data is an unavoidable fact of life in dealing with large quantities of data.  There are many ways of dealing with it, depending upon the circumstances:

- Discard it, and all related data.
- Interpolate values from surrounding data
- Isolate it and analyze it separately

Whatever approach is chosen - and this is a scientific, not a computational, question - pandas has methods to make it simpler to carry out.

FIrst, lets read a csv file that contains NaNs. Note here we set index_col to 0 which means we are using the first column as the index.

In [115]:
df = pd.read_csv('missing.csv', index_col=0)
df

        one       two     three      four
a -1.250699 -0.573801  0.705961 -1.015682
b       NaN -0.217766  0.655179  1.379276
c -0.860359 -1.313747  0.676174  1.034417
d       NaN       NaN       NaN       NaN
e  0.079169  0.029138  0.239183 -0.492039
f -1.149060       NaN       NaN -0.160499

If we have no idea about what the dataset looks like, the first thing we want to do is to figure out where the missing data is. We can use the isnull `method`.

In [116]:
df.isnull()

     one    two  three   four
a  False  False  False  False
b   True  False  False  False
c  False  False  False  False
d   True   True   True   True
e  False  False  False  False
f  False   True   True  False

Also we can sum up the boolean array to see how many missing values each column has:

In [117]:
np.sum(df.isnull())

one      2
two      2
three    2
four     1
dtype: int64

We may do the same for rows

In [118]:
np.sum(df.isnull(), axis=1)

a    0
b    1
c    0
d    4
e    0
f    2
dtype: int64

Sometimes we need a close look at those NaNs, so we want to have rows that only contain NaNs. To do that , we aggregate the data frame with boolean value, `df.isnull()`, by the function any. `axis=1` indicates rows.

In [119]:
df.isnull().any(axis=1)

a    False
b     True
c    False
d     True
e    False
f     True
dtype: bool

Passing the boolean Series to the first position of the `loc` method of the data frame selects the rows:

In [120]:
df.loc[df.isnull().any(axis=1),:]

       one       two     three      four
b      NaN -0.217766  0.655179  1.379276
d      NaN       NaN       NaN       NaN
f -1.14906       NaN       NaN -0.160499

<p><a name="labmiss"></a></p>
## In class lab: Handling Missing Data


**Exercise 23.** We now deal with the missing values. `Employee` is a very small data frame, let's just print it out and see how many missing values do we have. How many missing values do we have? **Remark** Some of the missing values are not in the form you might expect.

In [121]:
# There are totally 3 missing values.

In [122]:
Employee

  Department Education Sex      Title  Year      Name  Salary
0         IT  Bachelor   M    analyst   1.0       Bob    90.0
1         IT    Master   M    analyst   2.0      Jake    90.0
2         HR    Master   M    analyst   2.0      John    90.0
3         HR  Bachelor   F    analyst   2.0      Judy    90.0
4      Trade       PHD   M  associate   3.0       Sam   120.0
5          ?       PHD   F  associate   5.0       Amy   120.0
6      Trade    Master   F  associate   NaN  Jennifer   120.0
7         HR    Master   M         VP   8.0     Peter   262.5
8         IT             F         VP   9.0      Mary   262.5

**Exercise 24.** Now, we know that Amy works for a department called 'Trade'. Fill it in.

In [123]:
#### Your code here

  Department Education Sex      Title  Year      Name  Salary
0         IT  Bachelor   M    analyst   1.0       Bob    90.0
1         IT    Master   M    analyst   2.0      Jake    90.0
2         HR    Master   M    analyst   2.0      John    90.0
3         HR  Bachelor   F    analyst   2.0      Judy    90.0
4      Trade       PHD   M  associate   3.0       Sam   120.0
5      Trade       PHD   F  associate   5.0       Amy   120.0
6      Trade    Master   F  associate   NaN  Jennifer   120.0
7         HR    Master   M         VP   8.0     Peter   262.5
8         IT             F         VP   9.0      Mary   262.5

**Exercise 25.** Imagine we are dealing with a large data frame so it is not possible to pick the empty strings `''` manually. Look up for `replace` method to replace `''` by `np.nan`. Make sure you update the data frame. 
- **Remark** It is actually very common that missing values are not always represented by `NaN`s!

In [124]:
#### Your code here

  Department Education Sex      Title  Year      Name  Salary
0         IT  Bachelor   M    analyst   1.0       Bob    90.0
1         IT    Master   M    analyst   2.0      Jake    90.0
2         HR    Master   M    analyst   2.0      John    90.0
3         HR  Bachelor   F    analyst   2.0      Judy    90.0
4      Trade       PHD   M  associate   3.0       Sam   120.0
5      Trade       PHD   F  associate   5.0       Amy   120.0
6      Trade    Master   F  associate   NaN  Jennifer   120.0
7         HR    Master   M         VP   8.0     Peter   262.5
8         IT       NaN   F         VP   9.0      Mary   262.5

**Exercise 26.** How many missing values do we have in each row? How many in each column?

In [125]:
#### Your code here

Department    0
Education     1
Sex           0
Title         0
Year          1
Name          0
Salary        0
dtype: int64
---------------------------------------------------------------------------
0    0
1    0
2    0
3    0
4    0
5    0
6    1
7    0
8    1
dtype: int64

**Exercise 27.** Print the rows with missing values.

In [126]:
#### Your code here

  Department Education Sex      Title  Year      Name  Salary
6      Trade    Master   F  associate   NaN  Jennifer   120.0
8         IT       NaN   F         VP   9.0      Mary   262.5

**Exercise 28.** Print the columns with missing values.

In [127]:
#### Your code here

  Education  Year
0  Bachelor   1.0
1    Master   2.0
2    Master   2.0
3  Bachelor   2.0
4       PHD   3.0
5       PHD   5.0
6    Master   NaN
7    Master   8.0
8       NaN   9.0